imp/build/docs/runtime/style/app/App.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-06 Thu 16:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>App</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Atreyee" />
<link rel="stylesheet" type="text/css" href="./style/css/worg-style.css" />
<link rel="stylesheet" type="text/css" href="./style/css/override.css" />
<link rel="icon" type="image/png" href="./style/img/favicon/popl.png" />


</head>
<body>
<div id="content">
<h1 class="title">App</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb919c47">1. Introduction</a></li>
<li><a href="#org3aafd50">2. Language Extensions and Imports</a></li>
<li><a href="#orgaa125ad">3. Server</a></li>
<li><a href="#org5186cb9">4. Server Handlers</a></li>
<li><a href="#org8d8ff26">5. App Creation Functions</a></li>
<li><a href="#org947a6c5">6. Initialisation Functions</a>
<ul>
<li><a href="#orgce69f96">6.1. Admin User Invariant</a></li>
<li><a href="#orgb893422">6.2. Kill Sessions At Initialization</a></li>
</ul>
</li>
<li><a href="#org0af9e27">7. Tangling</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgb919c47" class="outline-2">
<h2 id="orgb919c47"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Controllers for handling the REST API routes.
</p>
</div>
</div>

<div id="outline-container-org3aafd50" class="outline-2">
<h2 id="org3aafd50"><span class="section-number-2">2</span> Language Extensions and Imports</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-haskell" id="org7d0ab87">{-# LANGUAGE DataKinds         #-}
{-# LANGUAGE DeriveGeneric     #-}
{-# LANGUAGE LambdaCase        #-}
{-# LANGUAGE OverloadedStrings #-}
{-# LANGUAGE TypeFamilies      #-}
{-# LANGUAGE TypeOperators     #-}

module App where

import           Data.Aeson
import           Data.Text
import           Control.Monad.IO.Class
import           Control.Monad.Logger (runStderrLoggingT)

import           Data.String.Conversions
import qualified Data.ByteString.Lazy.Char8 as B           

import           Database.Persist
import           Database.Persist.Sql
import           Database.Persist.Sqlite

import           Network.Wai
import           Network.Wai.Handler.Warp as Warp

import           Servant

import           Data.Text

import           Api
import           Models
import           Role
import           Authentication
import           Controllers
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa125ad" class="outline-2">
<h2 id="orgaa125ad"><span class="section-number-2">3</span> Server</h2>
<div class="outline-text-2" id="text-3">
<p>
Function defining the server. It takes an argument of type <code>ConnectionPool</code> (a
pool of connections to the underlying <code>sqlite</code> database) and returns a value of
type <code>Server UserAPI</code>.
</p>

<p>
All the controllers return a value wrapped in the <code>Handler</code> monad. This monad
lets us return a successful result, or fail using an error of type
<code>ServantErr</code>.
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="orga52f221">server :: ConnectionPool -&gt; Server UserAPI
server pool =
            (indexHandler 
       :&lt;|&gt; loginHandler)
       :&lt;|&gt; (showUsersHandler
       :&lt;|&gt; logoutHandler
       :&lt;|&gt; setNameHandler
       :&lt;|&gt; setEmailHandler)
       :&lt;|&gt; (showUserDetailsHandler
       :&lt;|&gt; addUserHandler
       :&lt;|&gt; deleteUserHandler
       :&lt;|&gt; showSessionsHandler
       :&lt;|&gt; showRolesHandler
       :&lt;|&gt; addRoleHandler
       :&lt;|&gt; deleteRoleHandler)

            where
</pre>
</div>
</div>
</div>

<div id="outline-container-org5186cb9" class="outline-2">
<h2 id="org5186cb9"><span class="section-number-2">4</span> Server Handlers</h2>
<div class="outline-text-2" id="text-4">
<p>
Handlers for the routes defined in the API.
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="orge441e1f">        -- authorisation required: none
        indexHandler :: Handler (Text)
        indexHandler = return "Welcome to User Directory"


        -- authorisation required: none
        loginHandler :: Session -&gt; Handler (Maybe (ResponseSessionId))
        loginHandler newSession = do
          isAuthorised &lt;- liftIO (hasRole pool newSession)
          case isAuthorised of
            True  -&gt; do
              ret &lt;- liftIO $ loginHelper newSession pool
              case ret of
                Nothing -&gt; throwError err400  -- error: constraint error
                Just _  -&gt; return ret
            False -&gt; throwError err403


        -- authorisation required: login
        showUsersHandler :: Maybe (String) -&gt; Handler ([ShowUserData])
        showUsersHandler authVal = do
          isAuthorised &lt;- liftIO (loginCheck pool $ headerCheck authVal)
          case isAuthorised of
            True  -&gt; liftIO $ (showAllUsersHelper pool True)
            False -&gt; throwError err403 {errBody = "User not logged in."}


        -- authorisation required: admin login
        addUserHandler :: Maybe (String) -&gt; User -&gt; Handler (Maybe (ResponseUserId))
        addUserHandler authVal newUser = do
          isAuthorised &lt;- liftIO (adminAuthCheck pool $ headerCheck authVal)
          case isAuthorised of
            True  -&gt; do
              ret &lt;- liftIO $ (addUserHelper newUser pool True)
              case ret of
                Nothing -&gt; throwError err404  -- error: constraint error
                Just _ -&gt; return ret
            False -&gt; throwError err401 {errBody = "Permission Denied."} 


        -- authorisation required: admin login
        deleteUserHandler :: Maybe (String) -&gt; UniqueUserData -&gt; Handler (Maybe (User))
        deleteUserHandler authVal userToDel = do
          isAuthorised &lt;- liftIO (isNotAdminSelfCheck pool (toTextDatatype userToDel) $ headerCheck authVal) 
          case isAuthorised of
            True  -&gt; do
              ret &lt;- liftIO (deleteUserHelper (toTextDatatype userToDel) pool True)
              case ret of
                Nothing -&gt; throwError err404  -- error: user not found error
                Just _  -&gt; return ret
            False -&gt; throwError err401 {errBody = "Permission Denied."} 


        -- authorisation required: login
        logoutHandler :: Maybe (String) -&gt; Session -&gt; Handler (Maybe (Session))
        logoutHandler authVal currentSession = do
          isAuthorised &lt;- liftIO (isSelfCheck pool (sessionToEmail currentSession) $ headerCheck authVal) 
          case isAuthorised of
            True  -&gt; do
              ret &lt;- liftIO (logoutHelper currentSession pool True)
              case ret of
                Nothing -&gt; throwError err404  -- error: user not found
                Just _  -&gt; return ret
            False -&gt; throwError err401 {errBody = "Permission Denied."}


        -- authorisation required : either NonAdmin and Self, or Admin
        setNameHandler :: Maybe (String) -&gt; UpdateUserData -&gt; Handler (Maybe (User))
        setNameHandler authVal userData = do
          isAuthorised &lt;- liftIO (isEitherAdminOrSelfCheck pool (currentData userData) $ headerCheck authVal)
          case isAuthorised of
            True  -&gt; do
              ret &lt;- liftIO (setNameHelper pool userData)
              case ret of
                Nothing -&gt; throwError err500
                Just _  -&gt; return ret 
            False -&gt; throwError err401 {errBody = "Permission Denied."}


        -- authorisation required : either NonAdmin and Self, or Admin
        setEmailHandler :: Maybe (String) -&gt; UpdateUserData -&gt; Handler (Maybe (User))
        setEmailHandler authVal userData = do
          isAuthorised &lt;- liftIO (isEitherAdminOrSelfCheck pool (currentData userData) $ headerCheck authVal)
          case isAuthorised of
            True  -&gt; do
              ret &lt;- liftIO (setEmailHelper pool userData)
              case ret of
                Nothing -&gt; throwError err500
                Just _  -&gt; return ret
            False -&gt; throwError err401 {errBody = "Permission Denied."}


        -- authorisation required: admin login
        showUserDetailsHandler :: Maybe (String) -&gt; String -&gt; Handler (Maybe (User))
        showUserDetailsHandler authVal userData = do
          isAuthorised &lt;- liftIO (adminAuthCheck pool $ headerCheck authVal)
          case isAuthorised of
            True  -&gt; do
              ret &lt;- liftIO (showUserDetailsHelper pool userData)
              case ret of
                Nothing -&gt; throwError err500
                Just _  -&gt; return ret
            False -&gt; throwError err401 {errBody = "UNAUTHORISED."}


        -- authorisation required: admin login
        showSessionsHandler :: Maybe (String) -&gt; Handler ([Session])
        showSessionsHandler authVal = do
          isAuthorised &lt;- liftIO (adminAuthCheck pool $ headerCheck authVal)
          case isAuthorised of
            True  -&gt; liftIO (showSessionsHelper pool)
            False -&gt; throwError err401 {errBody = "UNAUTHORISED."}


        -- authorisation required: admin login
        showRolesHandler :: Maybe (String) -&gt; String -&gt; Handler ([Role])
        showRolesHandler authVal userData = do
          isAuthorised &lt;- liftIO (adminAuthCheck pool $ headerCheck authVal)
          case isAuthorised of
            True  -&gt; do
              ret &lt;- liftIO (showRolesHelper pool userData)
              case ret of
                [] -&gt; throwError err500
                otherwise  -&gt; return ret 
            False -&gt; throwError err401 {errBody = "UNAUTHORISED."}


        -- authorisation required: admin login
        addRoleHandler :: Maybe (String) -&gt; String -&gt; Role -&gt; Handler (Maybe (User))
        addRoleHandler authVal userData newRole = do
          isAuthorised &lt;- liftIO (adminAuthCheck pool $ headerCheck authVal)
          case isAuthorised of
            True  -&gt; do
              ret &lt;- liftIO (addRoleHelper pool userData newRole)
              case ret of
                Nothing -&gt; throwError err500
                Just _  -&gt; return ret
            False -&gt; throwError err401 {errBody = "UNAUTHORISED."}


        -- authorisation required: admin login
        deleteRoleHandler :: Maybe (String) -&gt; String -&gt; Role -&gt; Handler (Maybe (User))
        deleteRoleHandler authVal userData roleToDel = do
          isAuthorised &lt;- liftIO (adminAuthCheck pool $ headerCheck authVal)
          case isAuthorised of
            True  -&gt; do
              ret &lt;- liftIO (deleteRoleHelper pool userData roleToDel)
              case ret of
                Nothing -&gt; throwError err500
                Just _  -&gt; return ret
            False -&gt; throwError err401 {errBody = "UNAUTHORISED."}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8d8ff26" class="outline-2">
<h2 id="org8d8ff26"><span class="section-number-2">5</span> App Creation Functions</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-haskell" id="orgc013414">-- function that takes the server function and returns a WAI application 
app :: ConnectionPool -&gt; Application
app pool = serve userAPI $ server pool
           where
             userAPI :: Proxy UserAPI
             userAPI = Proxy

-- to integrate Persist backend with API
-- createSqlitePool creates a pool of database connections
mkApp :: FilePath -&gt; IO Application
mkApp sqliteFile = do
  pool &lt;- runStderrLoggingT $ do
    createSqlitePool (cs sqliteFile) 5

  runSqlPool (runMigration migrateAll) pool
  adminUserCheck pool
  assassinateSessions pool
  return $ app pool


-- to run the SQL database
run :: FilePath -&gt; IO ()
run sqliteFile = 
  Warp.run 8000 =&lt;&lt; mkApp sqliteFile
</pre>
</div>
</div>
</div>
<div id="outline-container-org947a6c5" class="outline-2">
<h2 id="org947a6c5"><span class="section-number-2">6</span> Initialisation Functions</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgce69f96" class="outline-3">
<h3 id="orgce69f96"><span class="section-number-3">6.1</span> Admin User Invariant</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Admin user invariants include :
</p>

<ul class="org-ul">
<li>The system must have a single user with <code>roles = Admin</code>.</li>
<li>The system cannot have less than one user.</li>
</ul>

<div class="org-src-container">
<pre class="src src-haskell" id="org814d119">-- | To check if admin user exists
adminUserCheck :: ConnectionPool -&gt; IO(String)
adminUserCheck pool = flip runSqlPersistMPool pool $ do
  adminUser &lt;- selectFirst [UserRoles ==. [Admin]] []
  case adminUser of
    Nothing -&gt; do
      adminUserId &lt;- insert $ User "admin-user" "admin@email.com" $ [Admin]
      return "Admin User Added"
    Just _ -&gt; return "Admin User Exists"
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb893422" class="outline-3">
<h3 id="orgb893422"><span class="section-number-3">6.2</span> Kill Sessions At Initialization</h3>
<div class="outline-text-3" id="text-6-2">
<p>
To kill any sessions in the database when the webapp is booted.
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="orgfbe88f4">-- | To kill all sessions in database on initialisation
assassinateSessions :: ConnectionPool -&gt; IO ()
assassinateSessions pool = flip runSqlPersistMPool pool $
  deleteWhere ([] :: [Filter Session])
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0af9e27" class="outline-2">
<h2 id="org0af9e27"><span class="section-number-2">7</span> Tangling</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-haskell" id="orgdb98fab">&lt;&lt;extns_and_imports&gt;&gt;
&lt;&lt;admin_user_invariant&gt;&gt;
&lt;&lt;assassinate_sessions&gt;&gt;
&lt;&lt;server&gt;&gt;
&lt;&lt;server_handlers&gt;&gt;
&lt;&lt;app_creation_functions&gt;&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Atreyee</p>
<p class="date">Created: 2017-07-06 Thu 16:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
